#Задание 1  Введите с клавиатуры 2 числа и распечатайте все четные числа в этом диапазоне

# a = int(input("Первое число: "))
# b = int(input("Второе число: "))
#
# even = [x for x in range(a, b + 1) if x % 2 == 0]
# print(even)



#Задание 2 Число n вводится с клавиатуры. Найдите минимальный делитель числа n, отличный от 1
# n = int(input("Введите число: "))
#
# for x in range(2, n + 1):
#     if n % x == 0:
#         print("Минимальный делитель:", x)
#         break

#Задание 3 Число n вводится с клавиатуры. Найдите сумму первых n нечетных чисел
# n = int(input("Введите число: "))
#
# odd = [x for x in range(1, 2 * n, 2)]
# print("Сумма первых", n, "нечетных чисел:", sum(odd))

